dwgan/STKNX_CO2Sensor/source/drivers/uart/STM32G0XXX/source/Stm32G0xxx_uart.c
/*****************************************************************************************
* Copy right (C) for *********** company.(2016)
*
* File Name        : Stm32G0xxx_uart.c
*
* File Description : driver for stm32f0xxx cpu's uart.
*
* Other Description: this file realizes the driver of Stm32G0xx uart.
*
* Version          : 1.00
*
* Author           : 
*
* Data             : 2016.7.28
*
* Modification Rec.:
*   Modify Data    : 2016.7.28
*   Operator       :
*   Version        : 1.00
*   Action         : Creation.
*
*****************************************************************************************/


#include "type_def.h"
#include "Sw_common.h"
#include "Pub.h"
#include "boardcfg.h"
#include "Hardware.h"
#include "Boardctrl.h"
#include "Stm32G0xxx_uart.h"
#include "comm_service.h"




/* Declaration of static functions */
static void Uartx_isr(BYTE ucDevNo);
WORD32 Uartx_Ctrl(T_SW_DEVICEDRIVER_PARA *ptPara);


/* Base address of uart registers */
static const T_UART_MEM_MAP sg_aptUartAddr[5] = {UART1_BASE, UART2_BASE, UART3_BASE, UART4_BASE, UART5_BASE};

/* Baud rate table */
static const WORD16 sg_awBaudRate[8] = {6, 12, 24, 48, 96, 192, 384, 1152};

/* Uart operation functions */
static T_DEV_OPERATION sg_tUartOp;

/* Callback function for uart interrupt */
static void (*sg_pfAppCallBack[5])(T_SW_INT_EVENT *ptReason) = {NULL,NULL,NULL,NULL,NULL};     

/**************************************************************************
* Function: WORD32 Uartx_Init(T_SW_DEVICEDRIVER_PARA *ptPara)
* Descrip.: Init operation of uartx
* Input   : T_SW_DEVICEDRIVER_PARA *ptPara:
*           pIntCallBackHandler£º                             Interrupt callback
*           pExceptionIntCallBackHandler:                     Exception callback
*           ucPara[0]      BYTE      1-                       Device type ID
*           ucPara[1]      BYTE      0-4                      Channel number
*           ucPara[2]      BYTE      SW_COMM_TXINT_DISEN      Disable Tx interrupt
*                                    SW_COMM_RXINT_DISEN      Disable Rx interrupt
*                                    SW_COMM_TXINT_EN         Enable Tx inetrrupt
*                                    SW_COMM_RXINT_EN         Enable Rx interrupt
*                                    SW_COMM_DEV_CONFIG       Configure uart
*                                    SW_COMM_GET_RX_STAT      Get rx status
*                                    SW_COMM_GET_TX_STAT      Get tx status
*                                    SW_COMM_RX_DISEN         Disable Rx function
*                                    SW_COMM_TX_DISEN         Disable Tx function                                   
*           pucBuf         BYTE*                              Buffer for data from upper layer      
*           wBufLen        WORD16    0-65535                  Length of data in buffer
* Output  : None
* Return  : SW_OK    Successful
*           SW_ERR   Failed
* Note    £ºNone
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/25       V1.0         Ian          Create 
**************************************************************************/
WORD32 Uartx_Init(T_SW_DEVICEDRIVER_PARA *ptPara)
{
    WORD32 dwRet;
    BYTE            ucDevNo;
    volatile WORD16 wData;
    T_UART_MEM_MAP  ptUartNo;

    /* Check if the input parameter is valid or NOT */
    if(NULL == ptPara)                                                          
    {   
        return SW_ERR;
    }
    
    /* Check if the command is valid or NOT */
    if (SW_COMM_DEV_CONFIG != ptPara->ucPara[UART_OPERATION_CMD])              
    {
        return SW_ERR;
    }

    /* Get uart number and register address */
    ucDevNo = ptPara->ucPara[UART_DEV_NO];

    /* Check if the uart number is valid or NOT */
    if(ucDevNo >= MAX_UART_DEVICE_NUM)
    {
        return SW_ERR;
    }
    
    ptUartNo = sg_aptUartAddr[ucDevNo];
    
    /* Enable uart clock and reset */
    if(UART_1 == ucDevNo) /* If it is uart1 */
    {
        RCC_APB2ENR  |=   RCC_APB2ENR_USART1EN;      /* Enable uart clock */
        RCC_APB2RSTR |=   RCC_APB2RSTR_USART1RST;    /* Reset uart device */
        RCC_APB2RSTR &= ~(RCC_APB2RSTR_USART1RST);   /* Stop reset uart   */     
    }    
    else /* If it is uart 2~5 */
    {
        RCC_APB1ENR  |=  (RCC_APB1ENR_USART2EN   << (ucDevNo - UART_2)); /* Enable uart clock */
        RCC_APB1RSTR |=  (RCC_APB1RSTR_USART2RST << (ucDevNo - UART_2)); /* Reset uart device */
        RCC_APB1RSTR &= ~(RCC_APB1RSTR_USART2RST << (ucDevNo - UART_2)); /* Reset uart device */
    }

    /* Disable Tx/Rx function, Tx/Rx interrupt and Error interrupt before uart init operation */
    UARTX_CR1(ptUartNo) &= ~(USART_CR1_RE\
                           | USART_CR1_TE\
                           | USART_CR1_UE\
                           | USART_CR1_RXNEIE_RXFNEIE\
                           | USART_CR1_TXEIE_TXFNFIE\
                           | USART_CR1_PEIE);
    UARTX_CR3(ptUartNo) &= ~(USART_CR3_EIE);

    
    /* Configure stop bit, bit mode, parity and Buad rate */
    dwRet = Uartx_Ctrl(ptPara);
    if (SW_ERR == dwRet)
    {
        return SW_ERR;
    }
    
    /* Clear error flags and data buffer */
    UARTX_ICR(ptUartNo) = 0x0a5f;
    wData               = UARTX_DR(ptUartNo);
    
    /* Enable Tx/Rx function, Rx interrupt and Error interrupt */
    UARTX_CR1(ptUartNo) |= (USART_CR1_RE\
                          | USART_CR1_TE\
                          | USART_CR1_UE\
                          | USART_CR1_RXNEIE_RXFNEIE\
                          | USART_CR1_PEIE);
    UARTX_CR3(ptUartNo) |=  USART_CR3_EIE;
        
    /*------------Register callback function---------------------*/                              
    sg_pfAppCallBack[ucDevNo] = ptPara->pIntCallBackHandler; 

    return SW_OK;  
}


/**************************************************************************
* Function: WORD32 Uartx_Ctrl(T_SW_DEVICEDRIVER_PARA *ptPara)
* Descrip.: Control and configuration of uart
* Input   : T_SW_DEVICEDRIVER_PARA *ptPara:
*           pIntCallBackHandler£º                             Interrupt callback
*           pExceptionIntCallBackHandler:                     Exception callback
*           ucPara[0]      BYTE      1-                       Device type ID
*           ucPara[1]      BYTE      0-4                      Channel number
*           ucPara[2]      BYTE      SW_COMM_TXINT_DISEN      Disable Tx interrupt
*                                    SW_COMM_RXINT_DISEN      Disable Rx interrupt
*                                    SW_COMM_TXINT_EN         Enable Tx inetrrupt
*                                    SW_COMM_RXINT_EN         Enable Rx interrupt
*                                    SW_COMM_DEV_CONFIG       Configure uart
*                                    SW_COMM_GET_RX_STAT      Get rx status
*                                    SW_COMM_GET_TX_STAT      Get tx status
*                                    SW_COMM_RX_DISEN         Disable Rx function
*                                    SW_COMM_TX_DISEN         Disable Tx function
*                                     
*           When command is SW_COMM_DEV_CONFIG:
*           ucPara[3]      BYTE      SW_UART_CHAR_NUM_8       8 bits
*                                    SW_UART_CHAR_NUM_9       9 bits
*                                    SW_UART_CHAR_NUM_10      10 bits
*           ucPara[4]      BYTE      SW_UART_STOP_BIT_ONE     1-bit stop 
*                                    SW_UART_STOP_BIT_TWO     2-bit stop
*           ucPara[5]      BYTE      SW_UART_PARITY_NO        None Parity
*                                    SW_UART_PARITY_ODD       Odd Parity
*                                    SW_UART_PARITY_EVEN      Even Parity
*           ucPara[6]      BYTE      SW_UART_BAUD_4800        Baud rate: 4800
*                                    SW_UART_BAUD_9600        Baud rate: 9600
*                                    SW_UART_BAUD_19200       Baud rate: 19200
*                                    SW_UART_BAUD_38400       Baud rate: 38400
*                                    SW_UART_BAUD_115200      Baud rate: 115200
*           pucBuf         BYTE*                              Buffer for data from upper layer      
*           wBufLen        WORD16    0-65535                  Length of data in buffer
* Output  : ucPara[3]      BYTE      When command is SW_COMM_GET_RX_STAT or SW_COMM_GET_TX_STAT£º
*                                    SW_COMM_READY            Get received data/Data sending is done
*                                    SW_COMM_NOT_READY        No received data/Data sending is NOT finished
* Return  : SW_OK    Successful
*           SW_ERR   Failed
* Note    £ºNone
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/25       V1.0         Ian          Create 
**************************************************************************/
WORD32 Uartx_Ctrl(T_SW_DEVICEDRIVER_PARA *ptPara)
{
    BYTE   ucDevNo;
    WORD32 dwMantissa, dwFraction, dwPCLK, dwBaudRate;
    T_UART_MEM_MAP ptUartNo;
    
    /* Check if input parameter is valid or NOT */
    if(NULL == ptPara)
    {
        return SW_ERR;
    }

