dwgan/STKNX_CO2Sensor/source/drivers/uart/STM32G0XXX/source/Stm32G0xxx_uart.c
    /* If it is Tx interrupt */
    else if(UARTX_CR1(ptUartNo) & USART_CR1_TXEIE_TXFNFIE)
    {
        /* Disable Tx interrupt */
        UARTX_CR1(ptUartNo) &= ~(USART_CR1_TXEIE_TXFNFIE);
        tReason.ucEvent      = INTERRUPT_EVENT_TX;                           
    }

    /* Call callback functon with reason */
    if(sg_pfAppCallBack[ucDevNo])
    {
        (sg_pfAppCallBack[ucDevNo])(&tReason);
    }
    
    return;
}

/**************************************************************************
* Funciton: void Uart1_isr(void)
* Descrip.: interrupt process function of uart1
* Input   : None
* Output  : None
* Return  : None
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/26       V1.0         Ian          Create 
**************************************************************************/
void Uart1_isr(void)
{
    Uartx_isr(UART_1);  /* Call uart 1 interrupt process function */

    return;
}

/**************************************************************************
* Funciton: void Uart2_isr(void)
* Descrip.: interrupt process function of uart2
* Input   : None
* Output  : None
* Return  : None
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/26       V1.0         Ian          Create 
**************************************************************************/
void Uart2_isr(void)
{
    Uartx_isr(UART_2);  /* Call uart 2 interrupt process function */

    return;
}

/**************************************************************************
* Funciton: void Uart3_isr(void)
* Descrip.: interrupt process function of uart3
* Input   : None
* Output  : None
* Return  : None
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/26       V1.0         Ian          Create 
**************************************************************************/
void Uart3_isr(void)
{
    Uartx_isr(UART_3);  /* Call uart 3 interrupt process function */

    return;
}


/**************************************************************************
* Funciton: void Uart4_isr(void)
* Descrip.: interrupt process function of uart4
* Input   : None
* Output  : None
* Return  : None
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/26       V1.0         Ian          Create 
**************************************************************************/
void Uart4_isr(void)
{
    Uartx_isr(UART_4);  /* Call uart 4 interrupt process function */

    return;
}





// End of Uart0.c



